20240214T224307--kdoc-95-なぜjsonunmarshalの引数はバイト列なのか__draft_code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 95: なぜjson.Unmarshalの引数はバイト列なのか</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 95: なぜjson.Unmarshalの引数はバイト列なのか</h1>

<div id="outline-container-org57555ba" class="outline-2">
<h2 id="org57555ba"><a href="#org57555ba">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org57555ba">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-16 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> 2024-mm-dd &lt;署名&gt; (progn (kill-line 0) (insert (format &ldquo;  - [X] %s 貴島&rdquo; (format-time-string &ldquo;%Y-%m-%d&rdquo;))))</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgcb30d20" class="outline-2">
<h2 id="orgcb30d20"><a href="#orgcb30d20">概要</a></h2>
<div class="outline-text-2" id="text-orgcb30d20">
<p>
<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>でJSONをデシリアライズするときに使う関数のシグネチャはこうだ。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>JSONを構造体とかに格納する関数</label><pre class="src src-go">func Unmarshal(data []byte, v any) error {}
</pre>
</div>

<p>
引数は[]byteで、バイトスライスだ。どうして文字列ではないのか、違いは何かを考えた。が、なぜそうなったのかは見つけられず、自分の持っている知識ではよくわからなかった。
</p>
</div>
</div>

<div id="outline-container-org81815a1" class="outline-2">
<h2 id="org81815a1"><a href="#org81815a1">違い</a></h2>
<div class="outline-text-2" id="text-org81815a1">
<p>
stringと[]byteの違いは何か。本質的にはどちらもバイト列だ。文字列はイミュータブルで、バイトスライスはミュータブルという点は違う。したがってデータが変わるときはバイトスライスのほうがコストを低くできる。文字列だとメモリをアローケーションして作り直すしかないから。文字列だと特定のケースで遅くなる可能性があるから、バイトスライスにしている、などどうだろう。
</p>

<p>
コンピュータ内部やネットワーク間ではバイト列で処理してるだろうから、[]byteのほうが低レイヤで汎用的ではある。Goは書く量がやや増えるのを許容して汎用性を求める、ようなデザインをしているように見えるので自然に見える。が、確たる根拠はないし、ほかにstringを取る関数もたくさんある理由はわからない。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
